[
    {
      "Org/Univ": "El Oued University",
      "Title": "6th International Conference on Environmental Design and Health, ICED2025",
      "Date": "March 23, 2025",
      "Place": "El Oued University",
      "Link": "https://www.univ-eloued.dz/en/iced2025/",
      "Poster": "https://www.univ-eloued.dz/wp-content/uploads/2025/03/ICED2025-png.avif",
      "Content": "Dear Colleague, We invite you to submit your work to the 6th International Conference on Environmental Design and Health (ICED2025), 1-2 November 2025, Heraklion, Crete, Greece and Virtual ( Please submit your contribution before 30 March 2025. ICED2025 will take place in a face-to-face meeting in Heraklion and also virtual. The conference will combine the most recent scientific developments in Environmental Design (Sustainability / Pollution / Energy / Cities-Buildings / Transportation / Erosion / Climate Change / Policy / Social Acceptance / Health Issues). ICED2025 will provide a unique opportunity for experts to interact and to apply their knowledge and latest research findings to the design and developments of environmental processes and also to discuss health issues. SUBMIT YOUR ABSTRACT CONFERENCE TIMELINE * Deadline for the submissions of 1 page abstract: 30 March 2025 * Notification of abstracts acceptance: After 15 April 2025 * Deadline for the submission of full papers or 1 page poster: 25 May 2025 * Deadline for the submission of revised full papers or posters: 20 June 2025 * Notification of papers or posters acceptance: After 25 June 2025 * Deadline for registrations: For the authors of papers and posters: 7 July 2025 * Deadline for registrations: For the other participants: 14 July 2025 * Conference: 1-2 November 2025 THEMATIC AREAS The conference will discuss the recent progress in the areas of: * Sustainability * Pollution – Pollution Control (outdoor and indoor air pollution, water pollution, soil pollution, noise and light pollution) * Analysis of Pollutants * Environmental Impact Studies * Circular Economy * Energy Sustainability, Environmental Impacts of Energy (RES/Fossil Fuels/Nuclear) * Sustainable Mobility, Impacts of Transportation on the Environment * Environmental Design of Buildings and Cities * Erosion, Protection of Specific Zones (Coastal Zone, Mountains,…), Geotechnical Projects * Climate Change, Meteorology, Mitigation of Greenhouse Gas, Adaptation and Impacts of Climate Change * Effects of Pollution, Climate Change and Environmental Parameters on Human Health and Ecosystems * Economic, Historical, Legal, Social and Political Issues of Energy and Environment, Political Ecology * Environmental Education * Environmental Policy * Social Acceptance of Environmental Problems * Theoretical Design Issues / Impacts of Environmental Design * Health Impacts, Health Issues PROCEEDINGS The Conference Proceedings will be published in a Scopus-indexed Conference Series. WELCOME TO HERAKLION Heraklion, the capital of Crete, is a unique city combing History with Modernism, Culture with Everyday Life, Sea with Mountain, Mediterranean with Ethnic food, Day with Night Life, Shopping with Strolling, Sports with Leisure, and many more. We are looking forward to receive your abstract. If you have any questions or need any assistance, please do not hesitate to contact us Best regards, The Organizing Committee 6th International Conference on Environmental Design and Health (ICED2025) E-mail: [email protected] If you want to unsubscribe, please reply to this mail by putting “unsubscribe” in the subject.",
      "Num_Visitors": 156,
      "category": "Environmental Science & Health"
    },
    {
      "Org/Univ": "El Oued University",
      "Title": "The Second International Seminar On Catalysis, Chemical Engineering 1 Green Chemical “CACEG-25”",
      "Date": "March 6, 2025",
      "Place": "El Oued University",
      "Link": "https://www.univ-eloued.dz/en/caceg-25/",
      "Poster": "https://www.univ-eloued.dz/wp-content/uploads/2025/03/CACEG-25-png.avif",
      "Content": "This Second International Seminar, CACEG-25, focuses on the critical fields of Catalysis and Chemical Engineering, with a specific emphasis on Green Chemistry principles. Scheduled for March 6, 2025, at El Oued University, the event aims to bring together researchers, engineers, and industry professionals. Discussions will likely revolve around sustainable chemical processes, advancements in catalytic materials, and environmentally friendly approaches to chemical production. The seminar provides a platform for sharing cutting-edge research, fostering collaborations, and exploring innovations that minimize environmental impact while advancing chemical engineering practices. Attendees can expect presentations on novel catalysts, green solvents, process intensification, and the application of green chemistry in various industrial sectors. It's an opportunity to learn about the latest trends shaping a more sustainable future for chemical industries globally.",
      "Num_Visitors": 287,
      "category": "Chemical Engineering"
    },
    {
      "Org/Univ": "El Oued University",
      "Title": "ملتقى وطني حول : المخدرات والمؤثرات العقلية في المجتمع التشخيص وسبل الوقاية والعلاج",
      "Date": "February 11, 2025",
      "Place": "El Oued University",
      "Link": "https://www.univ-eloued.dz/en/%d9%85%d9%84%d8%aa%d9%82%d9%89-%d9%88%d8%b7%d9%86%d9%8a-%d8%ad%d9%88%d9%84-%d8%a7%d9%84%d9%85%d8%ae%d8%af%d8%b1%d8%a7%d8%aa-%d9%88%d8%a7%d9%84%d9%85%d8%a4%d8%ab%d8%b1%d8%a7%d8%aa-%d8%a7%d9%84%d8%b9/",
      "Poster": "https://www.univ-eloued.dz/wp-content/uploads/2024/09/logoue.png",
      "Content": "This national forum, held on February 11, 2025, at El Oued University, addresses the critical issue of drugs and psychoactive substances within society. The title translates to 'National Forum on: Drugs and Psychoactive Substances in Society - Diagnosis, Prevention, and Treatment Methods.' The event aims to diagnose the current situation regarding substance abuse, exploring its prevalence and societal impact. Furthermore, it focuses on developing and discussing effective strategies for prevention, targeting vulnerable populations and raising awareness. A significant part of the forum will be dedicated to examining various treatment approaches and rehabilitation methods for individuals affected by addiction. Experts from healthcare, social work, law enforcement, and academia will likely converge to share insights, research findings, and best practices, fostering a multi-disciplinary approach to tackle this complex social and health challenge.",
      "Num_Visitors": 46,
      "category": "Social Sciences & Health"
    },
    {
      "Org/Univ": "El Oued University",
      "Title": "The third international conference on materials Energie & environment",
      "Date": "January 6, 2025",
      "Place": "El Oued University",
      "Link": "https://www.univ-eloued.dz/en/%d8%a7%d9%84%d9%86%d8%af%d9%88%d8%a9-%d8%a7%d9%84%d8%aa%d9%83%d9%88%d9%8a%d9%86%d9%8a%d8%a9-%d8%a7%d9%84%d8%ab%d8%a7%d9%86%d9%8a%d8%a9-%d8%ad%d9%88%d9%84-%d9%82%d8%a7%d9%86%d9%88%d9%86-%d8%a7%d9%84/",
      "Poster": "https://www.univ-eloued.dz/wp-content/uploads/2024/11/training-workshop-about-scientific-publishing-1-1024x724.jpg",
      "Content": "The Third International Conference on Materials, Energy & Environment, taking place on January 6, 2025, at El Oued University, focuses on the crucial intersection of these three fields. This event serves as a significant platform for researchers, scientists, and engineers to present and discuss the latest advancements in materials science, particularly those relevant to energy applications and environmental sustainability. Topics likely include the development of novel materials for renewable energy technologies (solar cells, batteries, catalysts), energy storage solutions, and materials for environmental remediation like carbon capture or water purification. The conference aims to foster dialogue on sustainable practices, resource efficiency, and the environmental impact of material life cycles. It seeks to highlight innovations that contribute to cleaner energy production, reduced pollution, and overall environmental protection through materials science.",
      "Num_Visitors": 220,
      "category": "Materials Science & Energy"
    },
    {
      "Org/Univ": "El Oued University",
      "Title": "The International conference on water resources& Environmental change",
      "Date": "January 6, 2025",
      "Place": "El Oued University",
      "Link": "https://www.univ-eloued.dz/en/%d8%a7%d9%84%d9%86%d8%af%d9%88%d8%a9-%d8%a7%d9%84%d8%aa%d9%83%d9%88%d9%8a%d9%86%d9%8a%d8%a9-%d8%a7%d9%84%d8%ab%d8%a7%d9%86%d9%8a%d8%a9-%d8%ad%d9%88%d9%84-%d9%82%d8%a7%d9%86%d9%88%d9%86-%d8%a7%d9%84/",
      "Poster": "https://www.univ-eloued.dz/wp-content/uploads/2024/11/training-workshop-about-scientific-publishing-1-1024x724.jpg",
      "Content": "This International Conference, held on January 6, 2025, at El Oued University, centers on the critical nexus of Water Resources and Environmental Change. It aims to address the growing challenges related to water scarcity, water quality, and the impacts of climate and environmental shifts on hydrological systems. Researchers, policymakers, and practitioners will gather to discuss sustainable water management strategies, innovative water treatment technologies, and adaptation measures to climate change impacts on water availability. Key themes likely include integrated water resource management, groundwater protection, hydrological modeling under changing environmental conditions, water governance, and the socio-economic implications of water stress. The conference provides a vital forum for sharing knowledge and fostering international collaboration to ensure water security and environmental resilience in the face of global change.",
      "Num_Visitors": 600,
      "category": "Environmental Science & Water Resources"
    },
    {
      "Org/Univ": "El Oued University",
      "Title": "إعلان تنظيم مؤتمر دولي حول السيادة الجوية “الواقع والتحديات” بدولة ليبيا",
      "Date": "November 21, 2024",
      "Place": "El Oued University",
      "Link": "https://www.univ-eloued.dz/en/%d8%a7%d9%84%d9%86%d8%af%d9%88%d8%a9-%d8%a7%d9%84%d8%aa%d9%83%d9%88%d9%8a%d9%86%d9%8a%d8%a9-%d8%a7%d9%84%d8%ab%d8%a7%d9%86%d9%8a%d8%a9-%d8%ad%d9%88%d9%84-%d9%82%d8%a7%d9%86%d9%88%d9%86-%d8%a7%d9%84/",
      "Poster": "https://www.univ-eloued.dz/wp-content/uploads/2024/11/training-workshop-about-scientific-publishing-1-1024x724.jpg",
      "Content": "This announcement concerns an International Conference focused on Air Sovereignty, specifically addressing its 'Reality and Challenges' in Libya. While hosted informationally by El Oued University (as per the link context, though the event location might be Libya), the conference, noted around November 21, 2024, delves into complex issues of international law, political science, and security studies related to national airspace control. Discussions likely cover the legal frameworks governing air sovereignty, the practical challenges of enforcement, technological advancements in airspace monitoring, and the geopolitical implications, particularly in regions facing instability or conflict. The conference aims to bring together experts to analyze the current state of air sovereignty in Libya and potentially other regions, exploring challenges posed by unauthorized intrusions, drone technology, and international air traffic management, seeking solutions and fostering dialogue on upholding national airspace integrity.",
      "Num_Visitors": 88,
      "category": "International Law & Political Science"
    },
    {
      "Org/Univ": "El Oued University",
      "Title": "The second training seminar on the new public procurement law (12/23)",
      "Date": "November 17, 2024",
      "Place": "El Oued University",
      "Link": "https://www.univ-eloued.dz/en/%d8%a7%d9%84%d9%86%d8%af%d9%88%d8%a9-%d8%a7%d9%84%d8%aa%d9%83%d9%88%d9%8a%d9%86%d9%8a%d8%a9-%d8%a7%d9%84%d8%ab%d8%a7%d9%86%d9%8a%d8%a9-%d8%ad%d9%88%d9%84-%d9%82%d8%a7%d9%86%d9%88%d9%86-%d8%a7%d9%84/",
      "Poster": "https://www.univ-eloued.dz/wp-content/uploads/2024/11/training-workshop-about-scientific-publishing-1-1024x724.jpg",
      "Content": "This event, held on November 17, 2024, at El Oued University, is the second training seminar dedicated to understanding the new Public Procurement Law, referenced as 12/23. The seminar is designed for professionals, administrators, and legal practitioners involved in public sector purchasing and contracting. Its primary goal is to provide in-depth knowledge and practical guidance on the updated regulations, procedures, and compliance requirements outlined in the new law. Topics covered likely include tendering processes, contract management, transparency mandates, dispute resolution mechanisms, and the legal implications of non-compliance. The training aims to ensure participants are well-versed in the intricacies of the law to promote efficiency, fairness, and accountability in public spending, ultimately enhancing governance and reducing risks associated with public procurement activities within Algeria.",
      "Num_Visitors": 50,
      "category": "Law & Governance"
    },
    {
      "Org/Univ": "El Oued University",
      "Title": "Training workshop on scientific publishing",
      "Date": "November 4, 2024",
      "Place": "El Oued University",
      "Link": "https://www.univ-eloued.dz/en/training-workshop-scientific-publishing/",
      "Poster": "https://www.univ-eloued.dz/wp-content/uploads/2024/11/training-workshop-about-scientific-publishing-1-1024x724.jpg",
      "Content": "Held on November 4, 2024, at El Oued University, this training workshop focuses specifically on the process and best practices of scientific publishing. It targets researchers, academics, and postgraduate students aiming to disseminate their research findings effectively through peer-reviewed journals and other scholarly channels. The workshop likely covers crucial aspects such as manuscript preparation, selecting appropriate journals, understanding the peer-review process, addressing reviewer comments, and adhering to ethical guidelines in research and publication. Additionally, it might explore strategies for increasing research visibility, understanding citation metrics, and navigating the complexities of open-access versus subscription-based publishing models. The overall objective is to equip participants with the necessary skills and knowledge to successfully publish their scientific work, contributing to their academic careers and the broader scientific community.",
      "Num_Visitors": 245,
      "category": "Academic Development & Research"
    },
    {
      "Org/Univ": "El Oued University",
      "Title": "Tunisian-Algerian Universities Conference 5 + 5",
      "Date": "October 27, 2024",
      "Place": "El Oued University",
      "Link": "https://www.univ-eloued.dz/en/tunisian-algerian-universities-conference/",
      "Poster": "https://www.univ-eloued.dz/wp-content/uploads/2024/10/Annonce-du-meeting-1-574x1024.jpg",
      "Content": "The Tunisian-Algerian Universities Conference 5 + 5, held on October 27, 2024, at El Oued University, signifies a collaborative initiative aimed at strengthening academic ties between universities in Tunisia and Algeria, potentially within the broader framework of the 5+5 Dialogue involving Western Mediterranean countries. This conference likely serves as a platform for university leaders, researchers, and educators from both nations to discuss mutual challenges and opportunities in higher education and research. Key areas of focus might include joint research projects, student and faculty exchange programs, curriculum development, quality assurance in higher education, and leveraging academic cooperation for regional development. The event aims to foster networking, share best practices, and identify concrete pathways for enhancing collaboration, thereby boosting the quality and impact of higher education across the Tunisian-Algerian border.",
      "Num_Visitors": 495,
      "category": "Higher Education & International Cooperation"
    },
    {
      "Org/Univ": "El Oued University",
      "Title": "Conference on the digital revolution in Santé",
      "Date": "October 27, 2024",
      "Place": "El Oued University",
      "Link": "https://www.univ-eloued.dz/en/conference-revolution-number-sante/",
      "Poster": "https://www.univ-eloued.dz/wp-content/uploads/2024/10/artificial-intelligence-1.jpg",
      "Content": "This conference, taking place on October 27, 2024, at El Oued University, centers on the profound impact of the 'Digital Revolution in Santé' (Health). It aims to explore how digital technologies are transforming healthcare delivery, research, and patient experience. Discussions are expected to cover a wide range of topics including telemedicine, electronic health records (EHRs), artificial intelligence in diagnostics and treatment planning, mobile health applications (mHealth), big data analytics for public health, and the ethical considerations surrounding digital health adoption. The event likely brings together healthcare professionals, IT experts, policymakers, and researchers to share innovations, discuss implementation challenges, address data privacy and security concerns, and strategize on leveraging digital tools to improve health outcomes, accessibility, and efficiency within the healthcare system, potentially with a focus on the Algerian context.",
      "Num_Visitors": 312,
      "category": "Health Technology & Digital Health"
    },
    {
      "Org/Univ": "El Oued University",
      "Title": "International Forum on Institutional Advocacy Work: Reality and Prospects",
      "Date": "October 20, 2024",
      "Place": "El Oued University",
      "Link": "https://www.univ-eloued.dz/en/institutional-advocacy-reality-and-prospects/",
      "Poster": "https://www.univ-eloued.dz/wp-content/uploads/2024/10/MAD.jpg",
      "Content": "The International Forum on Institutional Advocacy Work, held on October 20, 2024, at El Oued University, delves into the practice, effectiveness, and future directions of advocacy carried out by organizations and institutions. The forum examines the 'Reality and Prospects' of this field, likely analyzing how various institutions (governmental, non-governmental, academic, etc.) advocate for specific policies, social changes, or interests. Discussions might cover strategies for effective advocacy, the role of research and data, challenges in influencing policy, ethical considerations, measuring impact, and adapting advocacy work in a changing political and social landscape. It aims to bring together practitioners, researchers, policymakers, and activists to share experiences, critically assess current advocacy models, explore innovative approaches, and discuss the future potential and challenges for institutional efforts aimed at creating meaningful change.",
      "Num_Visitors": 256,
      "category": "Political Science & Public Policy"
    },
    {
      "Org/Univ": "El Oued University",
      "Title": "The First International Scientific Symposium on Public Education in Tunisia and Algeria: Gains, Reality and Challenges",
      "Date": "September 3, 2024",
      "Place": "El Oued University",
      "Link": "https://www.univ-eloued.dz/en/%d8%a7%d9%84%d9%86%d8%af%d9%88%d8%a9-%d8%a7%d9%84%d8%b9%d9%84%d9%85%d9%8a%d8%a9-%d8%a7%d9%84%d8%af%d9%88%d9%84%d9%8a%d8%a9-%d8%a7%d9%84%d8%a3%d9%88%d9%84%d9%89-%d8%ad%d9%88%d9%84-%d8%a7%d9%84%d8%aa-2/",
      "Poster": "https://www.univ-eloued.dz/wp-content/uploads/2024/09/Public-Education-Symposium-1-724x1024.jpg",
      "Content": "This First International Scientific Symposium, held September 3, 2024, at El Oued University, provides a comparative perspective on Public Education systems in Tunisia and Algeria. It focuses on evaluating the 'Gains, Reality, and Challenges' within these two neighboring countries' educational landscapes. The symposium likely brings together educators, policymakers, researchers, and administrators to share insights on achievements and progress made in public education (gains), analyze the current state including resources, curriculum, and accessibility (reality), and identify pressing issues and obstacles (challenges). Topics might include educational reforms, teacher training, quality assessment, equity in access, integration of technology, and aligning education with national development goals. The goal is to foster cross-border learning and collaboration, seeking solutions to common challenges and enhancing the quality of public education in both nations.",
      "Num_Visitors": 252,
      "category": "Education & International Comparison"
    },
    {
      "Org/Univ": "El Oued University",
      "Title": "National in-person and virtual forum entitled Responsible Banking and Achieving Sustainable Development Goals - Algerian Banks between Reality and Hope",
      "Date": "August 15, 2024",
      "Place": "El Oued University",
      "Link": "https://www.univ-eloued.dz/en/%d9%85%d9%84%d8%aa%d9%82%d9%89-%d9%88%d8%b7%d9%86%d9%8a-%d8%ad%d8%b6%d9%88%d8%b1%d9%8a-%d9%88%d8%a7%d9%81%d8%aa%d8%b1%d8%a7%d8%b6%d9%8a-%d8%a8%d8%b9%d9%86%d9%88%d8%a7%d9%86-%d8%a7%d9%84%d8%b5%d9%8a/",
      "Poster": "https://www.univ-eloued.dz/wp-content/uploads/2024/08/IMG-20240813-WA0002.jpg",
      "Content": "This national hybrid forum (in-person and virtual), held August 15, 2024, at El Oued University, explores the critical role of 'Responsible Banking' in achieving the Sustainable Development Goals (SDGs) within the Algerian context. Titled 'Algerian Banks between Reality and Hope,' the event likely examines how financial institutions are currently incorporating environmental, social, and governance (ESG) principles into their operations and lending practices. It assesses the 'reality' of current sustainable finance initiatives by Algerian banks and explores the 'hope' or potential for banks to significantly contribute to national SDG targets related to poverty reduction, clean energy, economic growth, and climate action. Discussions might cover green finance, social impact investing, financial inclusion, corporate social responsibility in banking, and the regulatory landscape supporting sustainable finance, aiming to bridge the gap between current practices and future aspirations.",
      "Num_Visitors": 212,
      "category": "Finance & Sustainable Development"
    },
    {
      "Org/Univ": "El Oued University",
      "Title": "National in-person and virtual forum entitled “The Digital Economy and Its Impact on the Economy and International Trade in Algeria – Challenges and Prospects”",
      "Date": "August 15, 2024",
      "Place": "El Oued University",
      "Link": "https://www.univ-eloued.dz/en/%d9%85%d9%84%d8%aa%d9%82%d9%89-%d9%88%d8%b7%d9%86%d9%8a-%d8%ad%d8%b6%d9%88%d8%b1%d9%8a-%d9%88%d8%a7%d9%81%d8%aa%d8%b1%d8%a7%d8%b6%d9%8a-%d8%a8%d8%b9%d9%86%d9%88%d8%a7%d9%86-%d8%a7%d9%84%d8%a7%d9%82/",
      "Poster": "https://www.univ-eloued.dz/wp-content/uploads/2024/08/IMG-20240813-WA0002.jpg",
      "Content": "Held on August 15, 2024, at El Oued University as a hybrid event, this national forum addresses 'The Digital Economy and Its Impact on the Economy and International Trade in Algeria.' It focuses on analyzing both the 'Challenges and Prospects' associated with digitalization. The forum likely convenes experts from economics, business, technology, and government to discuss how digital transformation is reshaping Algeria's economic structure, business models, and participation in global trade. Key topics might include e-commerce growth, digital infrastructure development, the impact of fintech, cybersecurity threats, the need for digital skills development, and policy frameworks required to harness the benefits of the digital economy while mitigating risks. The event aims to provide a comprehensive overview of Algeria's digital economic landscape, identifying pathways for leveraging digitalization for sustainable growth and international competitiveness.",
      "Num_Visitors": 480,
      "category": "Economics & Digital Transformation"
    },
    {
      "Org/Univ": "El Oued University",
      "Title": "The Twenty-Sixth National Forum on the Jurisdiction of the International Criminal Court over the Palestinian Territories - Pathways to Accountability and Obstacles to Prosecution",
      "Date": "May 27, 2024",
      "Place": "El Oued University",
      "Link": "https://www.univ-eloued.dz/en/%d8%a7%d9%84%d9%85%d9%84%d8%aa%d9%82%d9%89-%d8%a7%d9%84%d9%88%d8%b7%d9%86%d9%8a-%d8%a7%d9%84%d8%b3%d8%a7%d8%af%d8%b3-%d9%88%d8%a7%d9%84%d8%b9%d8%b4%d8%b1%d9%88%d9%86-%d8%ad%d9%88%d9%84-%d8%a7%d9%84/",
      "Poster": "https://www.univ-eloued.dz/wp-content/uploads/2024/05/mol01-1.jpg",
      "Content": "This Twenty-Sixth National Forum, held May 27, 2024, at El Oued University, centers on a highly specific and complex issue: 'The Jurisdiction of the International Criminal Court (ICC) over the Palestinian Territories.' The forum focuses explicitly on exploring 'Pathways to Accountability and Obstacles to Prosecution.' It likely brings together legal scholars, international law experts, human rights advocates, and possibly political analysts to delve into the legal basis for ICC jurisdiction in Palestine, examine the procedural steps involved in potential investigations and prosecutions, and analyze the significant political, legal, and practical hurdles that impede the pursuit of accountability through the ICC. Discussions would cover admissibility criteria, complementarity principles, evidence gathering challenges, and the geopolitical pressures surrounding the situation, aiming to clarify the legal landscape and potential avenues for international justice.",
      "Num_Visitors": 43,
      "category": "International Law & Human Rights"
    },
    {
      "Org/Univ": "El Oued University",
      "Title": "The 22nd International Forum on the development of the Algerian-Tunisian border regions through the activation of twinning agreements",
      "Date": "April 29, 2024",
      "Place": "El Oued University",
      "Link": "https://www.univ-eloued.dz/en/%d8%a7%d9%84%d9%85%d9%84%d8%aa%d9%82%d9%89-%d8%a7%d9%84%d8%af%d9%88%d9%84%d9%8a-22-%d8%ad%d9%88%d9%84-%d8%aa%d9%86%d9%85%d9%8a%d8%a9-%d8%a7%d9%84%d9%85%d9%86%d8%a7%d8%b7%d9%82-%d8%a7%d9%84%d8%ad%d8%af/",
      "Poster": "https://www.univ-eloued.dz/wp-content/uploads/2024/04/The-22nd-International-Forum-on-the-development-of-the-Algerian-Tunisian-border-regions-through-activating-twinning-agreements. jpg",
      "Content": "The 22nd iteration of this International Forum, held April 29, 2024, at El Oued University, focuses on fostering 'Development of the Algerian-Tunisian border regions.' The specific mechanism explored is the 'Activation of twinning agreements' between communities or institutions on both sides of the border. This event likely gathers local government officials, development agencies, community leaders, and academics from both Algeria and Tunisia. The core objective is to assess the effectiveness of existing twinning arrangements and explore new opportunities for cross-border cooperation in areas like economic development, infrastructure projects, cultural exchange, environmental management, and social services. The forum aims to identify practical strategies for leveraging twinning agreements to overcome shared challenges and promote sustainable, integrated development that benefits the border communities in both countries.",
      "Num_Visitors": 34,
      "category": "Regional Development & International Cooperation"
    },
    {
      "Org/Univ": "El Oued University",
      "Title": "Study day on: The legal system for protecting national property from encroachment on real estate ownership in light of developments in Law 18/23",
      "Date": "April 25, 2024",
      "Place": "El Oued University",
      "Link": "https://www.univ-eloued.dz/en/%d8%a7%d9%84%d9%8a%d9%88%d9%85-%d8%a7%d9%84%d8%af%d8%b1%d8%a7%d8%b3%d9%8a-%d8%ad%d9%88%d9%84-%d8%a7%d9%84%d9%86%d8%b8%d8%a7%d9%85-%d8%a7%d9%84%d9%82%d8%a7%d9%86%d9%88%d9%86%d9%8a-%d9%84%d8%ad%d9%85/",
      "Poster": "https://www.univ-eloued.dz/wp-content/uploads/2024/04/900.png",
      "Content": "This dedicated Study Day, held April 25, 2024, at El Oued University, focuses on Algeria's 'Legal system for protecting national property' specifically against 'encroachment on real estate ownership.' Crucially, it examines this system 'in light of developments in Law 18/23,' suggesting recent legislative changes. The event targets legal professionals, government officials involved in land management, surveyors, and academics specializing in property law. Discussions likely analyze the provisions of Law 18/23 concerning national property, examine legal mechanisms for preventing and addressing encroachment (illegal occupation or use of state land), review enforcement procedures, and potentially discuss case law or practical challenges in applying the new legal framework. The objective is to ensure a clear understanding of the updated legal protections for national real estate assets and effective strategies for their implementation.",
      "Num_Visitors": 244,
      "category": "Law & Property Rights"
    },
    {
      "Org/Univ": "El Oued University",
      "Title": "The National Forum on the Organization of International Private Relations in Algeria - Between Reality and Aspirations -",
      "Date": "April 25, 2024",
      "Place": "El Oued University",
      "Link": "https://www.univ-eloued.dz/en/%d8%a7%d9%84%d9%85%d9%84%d8%aa%d9%82%d9%89-%d8%a7%d9%84%d9%88%d8%b7%d9%86%d9%8a-%d8%ad%d9%88%d9%84-%d8%aa%d9%86%d8%b8%d9%8a%d9%85-%d8%a7%d9%84%d8%b9%d9%84%d8%a7%d9%82%d8%a7%d8%aa-%d8%a7%d9%84%d8%ae/",
      "Poster": "https://www.univ-eloued.dz/wp-content/uploads/2024/04/70000.png",
      "Content": "Held on April 25, 2024, at El Oued University, this National Forum delves into the 'Organization of International Private Relations in Algeria.' This field, often known as private international law or conflict of laws, deals with legal issues involving individuals or entities from different countries (e.g., international marriages, contracts, inheritance). The forum's theme, 'Between Reality and Aspirations,' suggests a critical assessment of Algeria's current legal framework governing these cross-border private matters against desired or ideal standards. Legal experts, judges, academics, and practitioners likely discuss topics such as jurisdiction rules, choice of applicable law, recognition and enforcement of foreign judgments, and specific areas like international family law or commercial contracts. The aim is to identify strengths and weaknesses in the current system and propose potential reforms to better manage the complexities of international private relations.",
      "Num_Visitors": 124,
      "category": "International Law (Private)"
    },
    {
      "Org/Univ": "El Oued University",
      "Title": "The 6th International Conference Pattern Analysis & Intelligent Systems",
      "Date": "April 14, 2024",
      "Place": "El Oued University",
      "Link": "https://www.univ-eloued.dz/en/the-6th-international-conference-pattern-analysis-intelligent-systems/",
      "Poster": "https://www.univ-eloued.dz/wp-content/uploads/2024/04/CFP-1024x439.jpg",
      "Content": "The 6th International Conference on Pattern Analysis & Intelligent Systems (PAIS), held April 14, 2024, at El Oued University, is a significant event in the field of computer science and artificial intelligence. It brings together researchers and practitioners working on methods for identifying patterns in data and developing intelligent systems that can learn, reason, and act autonomously. Key topics likely include machine learning algorithms, computer vision, natural language processing, data mining, robotics, expert systems, and their applications in various domains like healthcare, finance, security, and engineering. The conference provides a platform for presenting cutting-edge research, sharing novel techniques, discussing theoretical advancements, and exploring the practical implementation challenges and successes of pattern analysis and intelligent systems. It fosters collaboration and knowledge exchange within this rapidly evolving technological field.",
      "Num_Visitors": 376,
      "category": "Computer Science & AI"
    },
    {
      "Org/Univ": "El Oued University",
      "Title": "International Conference on Experiments and modeling in Environment and Agriculture",
      "Date": "April 7, 2024",
      "Place": "El Oued University",
      "Link": "https://www.univ-eloued.dz/en/international-conference-on-experiments-and-modeling-in-environment-and-agriculture/",
      "Poster": "https://www.univ-eloued.dz/wp-content/uploads/2024/04/intfor.jpg",
      "Content": "This International Conference, held April 7, 2024, at El Oued University, focuses on the interplay between 'Experiments and Modeling' within the crucial domains of 'Environment and Agriculture.' It gathers scientists, researchers, and modelers to discuss advancements in both empirical research (experiments) and computational simulation (modeling) related to environmental processes and agricultural systems. Topics could range from climate change impacts on crop yields, soil science modeling, water resource management simulations, pest control experiments, ecosystem modeling, to the development of sustainable agricultural practices informed by both data and predictive models. The conference emphasizes the synergy between experimental data collection and model development/validation, aiming to improve our understanding and management of environmental and agricultural challenges through integrated scientific approaches, leading to more sustainable solutions.",
      "Num_Visitors": 204,
      "category": "Environmental Science & Agriculture"
    },
    {
      "Org/Univ": "El Oued University",
      "Title": "The First International Forum in Translation: Investing in specialized translation in the service of culture and scientific research",
      "Date": "April 4, 2024",
      "Place": "El Oued University",
      "Link": "https://www.univ-eloued.dz/en/%d8%a7%d9%84%d9%85%d9%84%d8%aa%d9%82%d9%89-%d8%a7%d9%84%d8%af%d9%88%d9%84%d9%8a-%d8%a7%d9%84%d8%a3%d9%88%d9%84-%d9%81%d9%8a-%d8%a7%d9%84%d8%aa%d8%b1%d8%ac%d9%85%d8%a9-%d8%ad%d9%88%d9%84-%d8%a7%d8%b3/",
      "Poster": "https://www.univ-eloued.dz/wp-content/uploads/2024/04/Forum-announcement_001.jpg",
      "Content": "Held on April 4, 2024, at El Oued University, the First International Forum in Translation centers on the theme: 'Investing in specialized translation in the service of culture and scientific research.' This event brings together translators, linguists, academics, researchers, and cultural practitioners to discuss the critical role of high-quality, specialized translation. It explores how investing in translation expertise (e.g., medical, legal, technical, literary) is essential for facilitating cross-cultural understanding, disseminating scientific knowledge globally, and preserving cultural heritage. Discussions likely cover translator training, terminology management, the impact of translation technologies, quality assurance in specialized domains, and the contribution of translation to international collaboration in research and cultural exchange. The forum aims to highlight the value of professional translation and advocate for greater investment in this vital field.",
      "Num_Visitors": 600,
      "category": "Translation Studies & Linguistics"
    }
]